package java_0624;

public class Tree_memo {
    public static void main(String[] args) {

        /*트리란?
        *
        * 트리를 구성하는 요소는 노드와 가지,
        * 노드는 데이터(키,값), 값만 있는 경우도 있음
        * 가지는 참조
        *
        * 트리의 가장 아랫부분에 위치하는 노드를 리프라고 함 즉, 자식이 없는 노드
        *
        * 트리를 탐색하는 방법론
        *
        * BFS(너비우선) , DFS(깊이우선)
        *
        * 이진 검색 트리는 이진트리가 다음 조건을 만족하면 된다.
        *
        * 1. 어떤 노드 N을 기준으로 왼쪽 서브트리 노드의 모든 키값은 노드N의 키값보다 작다.
        * 2. 오른쪽 서브트리 노드의 키값은 노드 N의 키값보다 크다.
        *
        * 노드 클래스 Node<K,V>

        * 이진 검색 트리의 개별 노드를 나타내는 노드클래스*/

    }
}
